[
  {
    "id": "post-1762253757679",
    "title": "hello india",
    "description": "kya bolti public",
    "date": "",
    "image": "https://images.pexels.com/photos/48148/document-agreement-documents-sign-48148.jpeg",
    "content": "hsdf  sdfkd   dif dsf dsif sddfids fsdi jodsfsdf sf df sodfisdop fisdofi sd fisdf sdifosdifsdfasfksdjf sdf aifudf iasduf sdf sdf sidufsdjf sdj"
  },
  {
    "id": "post-1",
    "title": "Understanding Legal Rights in Everyday Life",
    "description": "A practical guide to knowing your basic legal protections and how to use them.",
    "date": "2025-10-20",
    "image": "https://images.pexels.com/photos/5668882/pexels-photo-5668882.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "content": "Legal awareness empowers individuals to make informed decisions. In this article we walk through common scenarios—from workplace disputes to housing issues—and highlight the legal principles that apply.\n\nWhether you are drafting a contract or responding to a notice, understanding your rights is the first step to protecting them."
  },
  {
    "id": "post-2",
    "title": "How to Prepare for a Court Appearance",
    "description": "Key steps to take before attending court so you feel confident and prepared.",
    "date": "2025-10-15",
    "image": "https://images.pexels.com/photos/5668882/pexels-photo-5668882.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "content": "Attending court can be stressful, but preparation makes a world of difference. Start by organizing all relevant documentation and reviewing your timeline of events.\n\nConsulting with counsel ahead of time helps clarify expectations, dress code, and courtroom etiquette, ensuring you present your case clearly and respectfully."
  },
  {
    "id": "post-3",
    "title": "Emerging Trends in Tech Law for 2026",
    "description": "A look at the regulations shaping privacy, AI, and digital compliance in the coming year.",
    "date": "2025-10-12",
    "image": "https://images.pexels.com/photos/5668882/pexels-photo-5668882.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "content": "Technology is evolving rapidly and so is the legal landscape. Policymakers across the globe are focusing on AI governance, data portability, and cybersecurity standards.\n\nLegal teams should monitor draft regulations and participate in industry forums to stay ahead of compliance requirements and emerging liabilities."
  }
]
